
* Notes

* Eval

** Elisp

#+BEGIN_SRC emacs-lisp
  "Hello World"
#+END_SRC

#+RESULTS:
: Hello World

** Perl

#+BEGIN_SRC perl :results output
  print "Hello World"
#+END_SRC

#+RESULTS:
: Hello World

** Python stdout

#+BEGIN_SRC python :results output
  print("Hello World")
#+END_SRC

#+RESULTS:
: Hello World

** Python value

#+BEGIN_SRC python :results pp
  return "Hello World"
#+END_SRC

#+RESULTS:
: 'Hello World'

** zsh

#+BEGIN_SRC shell
  echo "Hello World"
#+END_SRC

#+RESULTS:
: Hello World

** C

#+BEGIN_SRC C :includes <unistd.h>
  printf("%s\n", "Hello World");
#+END_SRC

#+RESULTS:
: Hello World

** C++

#+BEGIN_SRC C++ :includes <iostream>
  std::cout << "Hello World" << std::endl;
#+END_SRC

#+RESULTS:
: Hello World

** Haskell

#+BEGIN_SRC haskell
  print "Hello World"
#+END_SRC

#+RESULTS:
: Hello World

** JavaScript

#+BEGIN_SRC js :results pp
  return "Hello World"
#+END_SRC

#+RESULTS:
: 'Hello World'

